import QtQuick 1.0
import "../js/global.js" as Global

ListModel {
    id: itemsModel
    Component.onCompleted: loadItemsData()
  //Component.onDestruction: saveItemsData()
    function loadItemsData() {
        var db = openDatabaseSync("DemoDB", "1.0", "Demo Model SQL", 50000);
        db.transaction(
            function(tx) {
                //tx.executeSql('DROP TABLE itemsData');
                // Create the database if it doesn't already exist
                //
                tx.executeSql('CREATE TABLE IF NOT EXISTS itemsData(id INTEGER primary key, tag TEXT, name TEXT, image TEXT, detail TEXT, price MONEY)');
                //var rs = tx.executeSql('SELECT * FROM itemsData ORDER BY id');
                var rs = tx.executeSql('SELECT * FROM itemsData WHERE tag = ?', [Global.tag]);
                var index = 0;
                if (rs.rows.length > 0) {
                    while (index < rs.rows.length) {
                        var item0 = rs.rows.item(index);
                        var item1 = rs.rows.item(index+1);
                        if (index + 1 == rs.rows.length) {
                            item1 = ''
                        }

                        itemsModel.append({"segment": Math.floor(index/6),
                                           "column": [{"name": item0.name, "image": item0.image, "detail": item0.detail, "price": item0.price},
                                                         {"name": item1.name, "image": item1.image, "detail": item1.detail, "price": item1.price}]});
                        console.log(item0.id)
                        console.log(item1.id)
                        index+=2;
                    }
                } else {
                    itemsModel.append({"id": 0,
                                       "tag": "特色",
                                       "name": "白菜心拌蜇头",
                                       "image": "qrc:/images/Tagine.jpg",
                                       "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 10.0});
                    itemsModel.append({"id": 1,
                                       "tag": "特色",
                                       "name": "白灵菇扣鸭掌",
                                       "image": "qrc:/images/Soft_Scamble_Breakfast.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 10.5});
                    itemsModel.append({"id": 2,
                                       "tag": "特色",
                                       "name": "拌豆腐丝",
                                       "image": "qrc:/images/BimBimBop.jpg",
                                          "detail": "下锅两面煎黄后以冬笋、香菇、葱段为配料，二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 12.5});
                    itemsModel.append({"id": 3,
                                       "tag": "特色",
                                       "name": "白切鸡",
                                       "image": "qrc:/images/Tomato-Basil-Lasagne.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 20.5});
                    itemsModel.append({"id": 4,
                                       "tag": "特色",
                                       "name": "拌双耳",
                                       "image": "qrc:/images/Carrot-Ginger-Soup.jpg",
                                          "detail": "又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 37.5});
                    itemsModel.append({"id": 5,
                                       "tag": "特色",
                                       "name": "冰梅凉瓜",
                                       "image": "qrc:/images/CheeseStraws.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 23.0});
                    itemsModel.append({"id": 6,
                                       "tag": "特色",
                                       "name": "冰镇芥兰",
                                       "image": "qrc:/images/Kermit-Lynch-Wine.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 17.5});
                    itemsModel.append({"id": 7,
                                       "tag": "特色",
                                       "name": "朝鲜辣白菜",
                                       "image": "qrc:/images/Blueberry_muffins.jpg",
                                          "detail": "康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 22.0});
                    itemsModel.append({"id": 8,
                                       "tag": "特色",
                                       "name": "陈皮兔肉",
                                       "image": "qrc:/images/baba-ganoush.jpg",
                                          "detail": "糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 13.0});
                    itemsModel.append({"id": 9,
                                       "tag": "特色",
                                       "name": "川北凉粉",
                                       "image": "qrc:/images/rustic_soup.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 22.5});
                    itemsModel.append({"id": 10,
                                       "tag": "特色",
                                       "name": "刺身凉瓜",
                                       "image": "qrc:/images/Tagine_Recipe.jpg",
                                          "detail": "康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 32.0});
                    itemsModel.append({"id": 11,
                                       "tag": "特色",
                                       "name": "豆豉多春鱼",
                                       "image": "qrc:/images/BimBimBop.jpg",
                                          "detail": "康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 10.0});
                    itemsModel.append({"id": 12,
                                       "tag": "特色",
                                       "name": "夫妻肺片",
                                       "image": "qrc:/images/rustic_soup.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，",
                                       "price": 17.0});
                    itemsModel.append({"id": 13,
                                       "tag": "特色",
                                       "name": "干拌牛舌",
                                       "image": "qrc:/images/Salmon_with_pesto.jpg",
                                          "detail": "此菜海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 14.0});
                    itemsModel.append({"id": 14,
                                       "tag": "特色",
                                       "name": "干拌顺风",
                                       "image": "qrc:/images/Summer_Salad.jpg",
                                          "detail": "取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 13.5});
                    itemsModel.append({"id": 15,
                                       "tag": "特色",
                                       "name": "怪味牛腱",
                                       "image": "qrc:/images/Cherries.jpg",
                                          "detail": "，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不汁酥面，口感极妙。",
                                       "price": 12.0});
                    itemsModel.append({"id": 16,
                                       "tag": "套餐",
                                       "name": "红心鸭卷",
                                       "image": "qrc:/images/Blueberry_muffins.jpg",
                                          "detail": "此菜清末民初便享下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，下入精细的焙面，热汁酥面，口感极妙。",
                                       "price": 10.0});
                    itemsModel.append({"id": 17,
                                       "tag": "套餐",
                                       "name": "姜汁皮蛋",
                                       "image": "qrc:/images/baba-ganoush.jpg",
                                          "detail": "此菜清末民初便享誉他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，酥面，口感极妙。",
                                       "price": 10.0});
                    itemsModel.append({"id": 18,
                                       "tag": "套餐",
                                       "name": "酱香猪蹄",
                                       "image": "qrc:/images/rustic_soup.jpg",
                                          "detail": "此菜清末民初便下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、面，热汁酥面，口感极妙。",
                                          "price": 10.0});
                    itemsModel.append({"id": 19,
                                       "tag": "套餐",
                                       "name": "酱肘花",
                                       "image": "qrc:/images/Tagine_Recipe.jpg",
                                          "detail": "此”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 10.0});
                    itemsModel.append({"id": 20,
                                       "tag": "套餐",
                                       "name": "金豆芥兰",
                                       "image": "qrc:/images/BimBimBop.jpg",
                                          "detail": "鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，，热汁酥面，口感极妙。",
                                          "price": 10.0});
                    itemsModel.append({"id": 21,
                                       "tag": "套餐",
                                       "name": "韭黄螺片",
                                       "image": "qrc:/images/rustic_soup.jpg",
                                          "detail": "。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 12.0});
                    itemsModel.append({"id": 22,
                                       "tag": "套餐",
                                       "name": "老北京豆酱",
                                       "image": "qrc:/images/Salmon_with_pesto.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 13.0});
                    itemsModel.append({"id": 23,
                                       "tag": "套餐",
                                       "name": "老醋泡花生",
                                       "image": "qrc:/images/Summer_Salad.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透精细的焙面，热汁酥面，口感极妙。",
                                       "price": 17.5});
                    itemsModel.append({"id": 24,
                                       "tag": "套餐",
                                       "name": "凉拌金针菇",
                                       "image": "qrc:/images/Cherries.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 25,
                                       "tag": "套餐",
                                       "name": "凉拌西芹云耳",
                                       "image": "qrc:/images/Tagine.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 26,
                                       "tag": "套餐",
                                       "name": "卤水牛舌",
                                       "image": "qrc:/images/Soft_Scamble_Breakfast.jpg",
                                          "detail": "汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 27,
                                       "tag": "套餐",
                                       "name": "美味牛筋",
                                       "image": "qrc:/images/BimBimBop.jpg",
                                          "detail": "此菜清末民初便享誉中原，色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 28,
                                       "tag": "套餐",
                                       "name": "泡椒凤爪",
                                       "image": "qrc:/images/Tomato-Basil-Lasagne.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 29,
                                       "tag": "套餐",
                                       "name": "乳猪拼盘",
                                       "image": "qrc:/images/Carrot-Ginger-Soup.jpg",
                                          "detail": "此菜色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 30,
                                       "tag": "套餐",
                                       "name": "珊瑚笋尖",
                                       "image": "qrc:/images/CheeseStraws.jpg",
                                          "detail": "意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 31,
                                       "tag": "套餐",
                                       "name": "爽口西芹",
                                       "image": "qrc:/images/Kermit-Lynch-Wine.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 32,
                                       "tag": "主食",
                                       "name": "四宝烤麸",
                                       "image": "qrc:/images/Soft_Scamble_Breakfast.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 33,
                                       "tag": "主食",
                                       "name": "松仁香菇",
                                       "image": "qrc:/images/BimBimBop.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 34,
                                       "tag": "主食",
                                       "name": "蒜茸海带丝",
                                       "image": "qrc:/images/Tomato-Basil-Lasagne.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 35,
                                       "tag": "主食",
                                       "name": "跳水木耳",
                                       "image": "qrc:/images/Carrot-Ginger-Soup.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 36,
                                       "tag": "主食",
                                       "name": "五彩酱鹅肝",
                                       "image": "qrc:/images/CheeseStraws.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 37,
                                       "tag": "主食",
                                       "name": "腌三文鱼",
                                       "image": "qrc:/images/Kermit-Lynch-Wine.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 38,
                                       "tag": "浓汤",
                                       "name": "盐水虾肉",
                                       "image": "qrc:/images/CheeseStraws.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 39,
                                       "tag": "浓汤",
                                       "name": "五味九孔",
                                       "image": "qrc:/images/Kermit-Lynch-Wine.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 40,
                                       "tag": "浓汤",
                                       "name": "明虾荔枝沙拉",
                                       "image": "qrc:/images/Soft_Scamble_Breakfast.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 41,
                                       "tag": "浓汤",
                                       "name": "香葱酥鱼",
                                       "image": "qrc:/images/BimBimBop.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 42,
                                       "tag": "小食",
                                       "name": "凉拌黄瓜 ",
                                       "image": "qrc:/images/BimBimBop.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 43,
                                       "tag": "小食",
                                       "name": "糖拌西红柿",
                                       "image": "qrc:/images/Tomato-Basil-Lasagne.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 44,
                                       "tag": "小食",
                                       "name": "八宝菠菜",
                                       "image": "qrc:/images/Carrot-Ginger-Soup.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 45,
                                       "tag": "小食",
                                       "name": "韭菜鲜桃仁",
                                       "image": "qrc:/images/CheeseStraws.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 46,
                                       "tag": "小食",
                                       "name": "香椿豆腐",
                                       "image": "qrc:/images/Kermit-Lynch-Wine.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 47,
                                       "tag": "小食",
                                       "name": "脆虾白菜心",
                                       "image": "qrc:/images/CheeseStraws.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和，各物、各味俱在，但均不出头，你中有我，我中有你；不见油，不见糖，不见醋，甜中透酸，酸中透咸，鱼肉肥嫩爽口而不腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                    itemsModel.append({"id": 48,
                                       "tag": "小食",
                                       "name": "豉油乳鸽皇",
                                       "image": "qrc:/images/Kermit-Lynch-Wine.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；二是取方言中和、活之谐音，糖、醋、油三物，甜、咸、酸三味，要在高温下，在搅拌中充分融和。",
                                          "price": 17.5});
                    itemsModel.append({"id": 49,
                                       "tag": "小食",
                                       "name": "卤水鸭舌",
                                       "image": "qrc:/images/Soft_Scamble_Breakfast.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要。",
                                          "price": 17.5});
                    itemsModel.append({"id": 50,
                                       "tag": "小食",
                                       "name": "香吃茶树菇",
                                       "image": "qrc:/images/BimBimBop.jpg",
                                          "detail": "此菜清末民初便享誉中原，素有“奇味”之称。他以大青鱼为主料，取头尾巧施刀工，摆置扒盘两端，鱼肉剁块圆铺在头尾之间。下锅两面煎黄后以冬笋、香菇、葱段为配料，上锅箅高汤旺火扒制，中小火收汁。汁浓鱼透、色泽红亮。食时头酥肉嫩，香味醇厚。民国初年，康有为游学汴京，尝此菜后有“味烹侯鲭”之赞，康君知味，意犹未尽，又书扇面“海内存知己 小弟康有为”赠又一村饭店的灶头黄润生，成一段文人、名厨相交之佳话。糖醋软熘鱼焙面又称熘鱼焙面、鲤鱼焙面，是豫菜的历史名菜。此菜名，首先在鲤鱼，河南得黄河中下游之利，金色鲤鱼，历代珍品。“岂其食鱼、必河之鲤”，此鱼上市，宋代曾有“不惜百金持于归”之语，可见之珍。其二是豫菜的软熘，他以活汁而闻名。所谓活汁，历来两解，一是熘鱼之汁需达到泛出泡花的程度，称作汁要烘活；腻。鱼肉食完而汁不尽，上火回汁，下入精细的焙面，热汁酥面，口感极妙。",
                                          "price": 17.5});
                }
            }
        )
    }

    function saveItemsData() {
        var db = openDatabaseSync("DemoDB", "1.0", "Demo Model SQL", 50000);
        db.transaction(
            function(tx) {
                tx.executeSql('DROP TABLE itemsData');
                tx.executeSql('CREATE TABLE IF NOT EXISTS itemsData(id INTEGER primary key, tag TEXT, name TEXT, image TEXT, detail TEXT, price MONEY)');
                var index = 0;
                while (index < itemsModel.count) {
                    var item = itemsModel.get(index);
                    tx.executeSql('INSERT INTO itemsData VALUES(?,?,?,?,?,?)', [item.id, item.tag, item.name, item.image, item.detail, item.price]);
                    index++;
                }
            }
        )
    }
}
